Repository: OPUS4/application
Catalog: modules/admin/language/enrichmentkey.tmx
Source language: de
Languages: en

source: Typ
en: Type

source: Typ-Konfiguration
en: Type Configuration

source: Bitte wählen Sie erst einen Typ aus, um eine Erklärung zur Typkonfiguration zu erhalten.
en: Please first select a type to get details on how to configure it appropriately.

source: Sollen existierende Werte validiert werden?
en: Validate existing values?

source: Durch das Aktivieren dieser Option können Sie bereits existierende Werte für diesen Enrichmentkey nur dann speichern, wenn diese gemäß seiner aktuellen Typ-Konfiguration gültig sind.
en: If this option is enabled, existing values of the given enrichment key are considered as invalid if they did not conform with its type configuration.

source: Enrichmentkeys Übersicht
en: Enrichmentkeys Overview

source: Neuer Enrichmentkey
en: New Enrichmentkey

source: Enrichmentkey bearbeiten
en: Edit Enrichmentkey

source: Enrichmentkey löschen
en: Delete Enrichmentkey

source: Enrichmentkey in Dokumenten entfernen
en: Remove Enrichmentkey from Documents

source: Keine Enrichmentkeys definiert.
en: No Enrichmentkeys defined.

source: Der Enrichmentkey existiert bereits.
en: Enrichmentkey already exists.

source: Interner Enrichmentkey ist nicht verfügbar.
en: Internal Enrichmentkey system is not available.

source: Anzeige des Enrichment-Labels in den unterstützten Sprachen.
en: Translations for label used when showing the enrichment key.

source: Beschreibung und Hinweise zur Nutzung des Enrichments.
en: Short description of the purpose and usage of this enrichment.

source: Dieser Typ erwartet keine Konfiguration.
en: This type does not require any configuration.

source: Bitte geben Sie einen gültigen regulären Ausdruck an, der die Wertemenge dieses Typs definiert.
en: Please provide a valid regular expression that defines the set of values of this type.

source: Bitte geben Sie die Werte zeilenweise ein.
en: Please provide the values line by line.

source: Dies ist ein Systemkey, welcher nicht modifiziert werden kann.
en: This is a system-key and can not be modified.

source: Dieser Enrichmentkey wird nicht benutzt.
en: This is an unused enrichment key.

source: Dieser Enrichmentkey wird benutzt.
en: This enrichmentkey is used.

source: Dieser Enrichmentkey ist nicht registriert.
en: This is an unregistered enrichment key.

source: Löschen des Enrichmentkeys %1$s in allen Dokumenten
en: Remove enrichment key %1$s from all documents

source: Soll der Enrichmentkey %1$s wirklich in allen Dokumenten gelöscht werden? Der Enrichmentkey wird hierbei nicht gelöscht.
en: Remove enrichment key %1$s from all documents? This operation does not delete the enrichment key itself.

source: Löschen des nicht registrierten Enrichmentkeys %1$s in allen Dokumenten
en: Remove unregistered enrichment key %1$s from all documents

source: Soll der nicht registrierte Enrichmentkey %1$s wirklich in allen Dokumenten gelöscht werden?
en: Remove unregistered enrichment key %1$s from all documents?

source: Übersetzungen
en: Translations

source: Registrierte Enrichments
en: Managed Keys

source: Enrichments ohne Typ
en: Unmanaged Keys
